In [11]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.random.randn(5,3),index=['a','c','e','h','g'],columns=['one','two','three'])
print(df)

        one       two     three
a -0.434272  0.663242  1.115759
c  2.544592 -0.079268 -1.724422
e  2.148151 -0.119347  0.675200
h  0.437836  0.121975 -1.303106
g  0.093074  1.159453  0.811164

In [12]:
df=df.reindex(['a','b','c','d','e','f','g','h'])
print(df)

        one       two     three
a -0.434272  0.663242  1.115759
b       NaN       NaN       NaN
c  2.544592 -0.079268 -1.724422
d       NaN       NaN       NaN
e  2.148151 -0.119347  0.675200
f       NaN       NaN       NaN
g  0.093074  1.159453  0.811164
h  0.437836  0.121975 -1.303106

In [13]:
df.isnull().any()

one      True
two      True
three    True
dtype: bool

In [14]:
df.isnull().sum()

one      3
two      3
three    3
dtype: int64

In [15]:
df.isnull().sum().sum()

9

In [16]:
df.fillna(0)
print(df)

        one       two     three
a -0.434272  0.663242  1.115759
b       NaN       NaN       NaN
c  2.544592 -0.079268 -1.724422
d       NaN       NaN       NaN
e  2.148151 -0.119347  0.675200
f       NaN       NaN       NaN
g  0.093074  1.159453  0.811164
h  0.437836  0.121975 -1.303106

In [17]:
df.fillna(method='pad')

        one       two     three
a -0.434272  0.663242  1.115759
b -0.434272  0.663242  1.115759
c  2.544592 -0.079268 -1.724422
d  2.544592 -0.079268 -1.724422
e  2.148151 -0.119347  0.675200
f  2.148151 -0.119347  0.675200
g  0.093074  1.159453  0.811164
h  0.437836  0.121975 -1.303106

In [18]:
df.fillna(method='bfill')

        one       two     three
a -0.434272  0.663242  1.115759
b  2.544592 -0.079268 -1.724422
c  2.544592 -0.079268 -1.724422
d  2.148151 -0.119347  0.675200
e  2.148151 -0.119347  0.675200
f  0.093074  1.159453  0.811164
g  0.093074  1.159453  0.811164
h  0.437836  0.121975 -1.303106

In [20]:
df.interpolate()

        one       two     three
a -0.434272  0.663242  1.115759
b  1.055160  0.291987 -0.304332
c  2.544592 -0.079268 -1.724422
d  2.346372 -0.099308 -0.524611
e  2.148151 -0.119347  0.675200
f  1.120613  0.520053  0.743182
g  0.093074  1.159453  0.811164
h  0.437836  0.121975 -1.303106

In [21]:
df.dropna()

        one       two     three
a -0.434272  0.663242  1.115759
c  2.544592 -0.079268 -1.724422
e  2.148151 -0.119347  0.675200
g  0.093074  1.159453  0.811164
h  0.437836  0.121975 -1.303106

In [22]:
df['one'].dropna()

a   -0.434272
c    2.544592
e    2.148151
g    0.093074
h    0.437836
Name: one, dtype: float64